package ru.itpark;

public class Main {

    public static void main(String[] args) {
        /**
         * ЗАДАЧА:
         * Реализовать интерфейс Фигура тремя классами:
         * Квадрат, Треугольник, Прямоугольник
         * Создать массив фигур
         * Удалить из массива фигур эквивалентные фигуры
         * Фигуры эквивалентны тогда, когда
         * у них одинаковый тип и одинаковые площадь и периметр
         * удалить - сделать null
         */
        System.out.println("Hello");
    }
}
